package com.example.assigment_2;

import android.text.method.LinkMovementMethod;

public class FromWebServes {

     private static final Lesson[] lessons = new Lesson[10];

    public static Lesson[] GetData (){
        lessons[0] = new Lesson("حيفا والنورس","درس \"حيفا والنورس\" هو قصة قصيرة للكاتب الفلسطيني غسان كنفاني. تروي القصة قصة صبي فلسطيني يدعى نمر، يعيش في مدينة حيفا، وهو محاط بالنورس. يعتبر نمر هذه النورس جزءًا من حياته اليومية ويشعر براحة كبيرة عند رؤيتها.\n" +
                "\n" +
                "تتطور القصة لتشير إلى تحول العلاقة بين نمر والنورس. يلاحظ نمر أن عدد النورس يقل بشكل متزايد، ويشعر بالحزن لفقدانها. يبدأ نمر في البحث عن السبب وراء اختفاء النورس ويكتشف أن المدينة تخضع للتغيرات الحضرية والتلوث البيئي، مما يؤثر على موطن النورس.\n" +
                "\n" +
                "بينما يحاول نمر البحث عن حل لهذه المشكلة، يكتشف أنه ليس الوحيد الذي يهتم بمصير النورس. يلتقي بمجموعة من النشطاء الذين يعملون على الحفاظ على البيئة والطيور. ينضم نمر إلى هؤلاء النشطاء ويساعد في إنشاء حديقة طبيعية للنورس وغيرها من الطيور.\n" +
                "\n" +
                "ينتهي الدرس بتأكيد أهمية الحفاظ على البيئة والحياة البرية وأن كل شخص يمكنه أن يكون جزءًا من هذا التغيير. تكمن الرسالة في أن العمل المشترك والحرص على المحافظة على الطبيعة يمكن أن يحقق فرقًا إيجابيًا في المجتمع والبيئة المحيطة بنا.",R.drawable.haifa);
        lessons[1] = new Lesson("يوم الشجرة", "درس \"يوم الشجرة\" يحتفل بأهمية الأشجار والغابات في حياتنا والبيئة. يُحتفل بهذا اليوم عادة في 21 مارس من كل عام، حيث يتم توعية الناس حول أهمية زراعة الأشجار والحفاظ على البيئة الطبيعية.\n" +
                "\n" +
                "تركز الدرس على قيمة الأشجار والغابات في حياتنا. تعتبر الأشجار مصدرًا هامًا للأكسجين، إذ تمتص ثاني أكسيد الكربون وتطلق الأكسجين خلال عملية التمثيل الضوئي. كما تعمل الأشجار على تحسين جودة الهواء وتقليل التلوث.\n" +
                "\n" +
                "تشير الدرس أيضًا إلى أهمية الأشجار في حفظ التنوع البيولوجي والحفاظ على المواطن الحيوية. الغابات توفر موطنًا للعديد من الكائنات الحية، بما في ذلك الحيوانات والطيور والنباتات، وتحافظ على توازن النظام البيئي.\n" +
                "\n" +
                "تعرض الدرس أيضًا تحديات التصحر وتآكل الأراضي وتقلص مساحات الغابات بسبب النشاط البشري. يتحدث عن أهمية إعادة زراعة الأشجار وتشجيع المجتمعات على المشاركة في حماية الغابات والحفاظ عليها.\n" +
                "\n" +
                "في نهاية الدرس، يشجع الطلاب على المشاركة في أنشطة زراعة الأشجار والمحافظة على البيئة، سواء كان ذلك عن طريق المشاركة في حملات زراعة الأشجار أو تعزيز الوعي البيئي في المجتمع المحلي. تكمن الرسالة في أن حماية الأشجار والغابات هي مسؤولية الجميع وأنها تعود بالفائدة على البيئة وحياتنا.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n", R.drawable.sahgara);
        lessons[2] = new Lesson("الراعي والذئب", "قصة \"الراعي والذئب\" هي قصة شعبية مشهورة تروي حكمة وعبرة حول الصداقة والثقة. تتحدث القصة عن راعي صغير يعتني بقطيع الأغنام ويحميها من الذئب.\n" +
                "\n" +
                "في بداية القصة، يقوم الراعي بإبلاغ الجميع عن هجوم الذئب ويطلب المساعدة، لكن الناس يعتبرون ذلك مزحة ولا يستجيبون لنداءه. يتكرر هذا السيناريو مرات عديدة، وفي كل مرة يصدق الناس أن الراعي يمزح ولا يوجد أي خطر حقيقي.\n" +
                "\n" +
                "وفي النهاية، يقرر الذئب الهجوم على القطيع ويحقق ما كان يتوعد به. يركض الراعي بحثًا عن المساعدة والنجدة، لكن لا أحد يأتي لمساعدته. يعود الراعي إلى القطيع ليجد الذئب قد أكل بعض الأغنام.\n" +
                "\n" +
                "تنتهي القصة بتأكيد العبرة، حيث يدرك الراعي أنه لم يكن ينبغي له أن يكذب ويخدع الناس حول خطورة الذئب. الثقة والمصداقية أمور حيوية في العلاقات الإنسانية، وعندما يفقد الناس الثقة فينا، قد يكون لهذا تأثير كبير على قدرتنا على الحصول على المساعدة والدعم في الوقت الحاسم.\n" +
                "\n" +
                "تكمن الرسالة الأساسية للقصة في أن الكذب وفقدان الثقة قد يؤديان إلى عواقب سلبية، وأنه من الأفضل دائمًا أن نكون صادقين وموثوقين، سواء كان ذلك في العلاقات الشخصية أو في الحياة المهنية.", R.drawable.raee);
        lessons[3] = new Lesson("اخب ان اكون", "درس \"أرغب أن أكون\" هو درس يهدف إلى تعزيز الوعي الذاتي وتحفيز الطلاب على تحقيق أحلامهم وتطوير أنفسهم. يركز الدرس على قوة العزم والتصميم الشخصي في تحقيق الأهداف.\n" +
                "\n" +
                "يبدأ الدرس بتشجيع الطلاب على التفكير بعمق حول ما يرغبون في أن يكونوا عندما يكبرون، سواء في الحياة المهنية أو الشخصية. يتم تحفيزهم على تصوّر أحلامهم وتحديد الخطوات التي يحتاجون إلى اتخاذها لتحقيقها.\n" +
                "\n" +
                "ثم يتحدث الدرس عن أهمية وضع الأهداف الواقعية والمحددة بوضوح. يشجع الطلاب على تحويل أحلامهم إلى أهداف صغيرة قابلة للقياس وتحديد الخطوات العملية التي يحتاجون إلى اتخاذها لتحقيق تلك الأهداف.\n" +
                "\n" +
                "يتم تسليط الضوء أيضًا على أهمية العمل الجاد والاجتهاد في سعينا لتحقيق أهدافنا. يتم تشجيع الطلاب على تطوير المهارات والمعرفة اللازمة لتحقيق أحلامهم والاستعداد للتحديات والعقبات التي قد تواجههم على الطريق.\n" +
                "\n" +
                "في النهاية، يتم تشجيع الطلاب على التفاؤل والإيمان بقدرتهم على تحقيق أهدافهم. تُذكّرهم الدرس بأنه مع العزيمة والتصميم الشخصي والاجتهاد، يمكنهم تحويل أحلامهم إلى حقيقة.\n" +
                "\n" +
                "تكمن الرسالة الأساسية للدرس في أن كل فرد يحمل القدرة على تحقيق أحلامه وأنه بالاستعداد المناسب والعمل الجاد، يمكننا تحويل رغباتنا إلى حقائق وتحقيق النجاح والتحسين الشخصي.", R.drawable.a7b);
        lessons[4] = new Lesson("من اخلاقنا", "درس \"من أخلاقنا\" هو درس يهدف إلى تعزيز القيم الأخلاقية والسلوك الحسن في الحياة اليومية. يركز الدرس على أهمية الأخلاق وتأثيرها على الفرد والمجتمع.\n" +
                "\n" +
                "يبدأ الدرس بتعريف الأخلاق وتوضيح أنها تعبر عن القيم والمعايير التي يتمتع بها الشخص وتوجه تصرفاته وسلوكه. يتم استعراض مجموعة من الالتزامات الأخلاقية الأساسية مثل الصدق، والعدل، والصبر، والتعاطف، والاحترام، والمساعدة الخيرية، وغيرها.\n" +
                "\n" +
                "تُشدد الدرس على أهمية ممارسة الأخلاق في حياتنا اليومية وفي التفاعل مع الآخرين. يتم توضيح أن الأخلاق الحسنة تعزز التعاون والتواصل الإيجابي وتسهم في بناء علاقات صحية ومتوازنة مع الآخرين.\n" +
                "\n" +
                "يتم تسليط الضوء على الأخلاق في مجالات مختلفة من الحياة مثل العمل، والمدرسة، والعلاقات الاجتماعية. يُحث الطلاب على تطبيق الأخلاق في هذه المجالات وتعزيزها من خلال التفاني في العمل، والاحترام للمعلمين والزملاء، والمشاركة في الأعمال الخيرية والمساعدة على نشر الخير والإيجابية.\n" +
                "\n" +
                "في النهاية، يُشدد الدرس على أن الأخلاق هي عنصر أساسي في بناء المجتمعات المزدهرة والسعي للتقدم والتطور. تكمن الرسالة الأساسية للدرس في أن الممارسة اليومية للأخلاق الحسنة تعكس قيمنا الحقيقية وتساهم في خلق عالم أفضل وأكثر إنسانية.", R.drawable.hqdefault);
        lessons[5] = new Lesson("في ميناء غزة", "درس \"في ميناء غزة\" يتناول قصة مؤثرة عن حياة الأطفال في مدينة غزة وتحدياتهم اليومية. يعرض الدرس الواقع الصعب الذي يواجهه الأطفال في ظل الحصار والصراع الدائر في المنطقة.\n" +
                "\n" +
                "تبدأ القصة بوصف ميناء غزة وأهميته في حياة الناس، حيث يعتبر الطريق الوحيد للمواطنين للوصول إلى العالم الخارجي. يتم تسليط الضوء على الحياة الصعبة التي يعيشها الأطفال في ظل الحصار والتقييدات الكبيرة على حرية التنقل والتجارة.\n" +
                "\n" +
                "تتناول القصة قصة طفل يُدعى أحمد، يعيش في ميناء غزة، ويحلم بأن يكون بحارًا ويستكشف العالم. ومع ذلك، يواجه تحديات كبيرة في تحقيق حلمه بسبب القيود والصعوبات المحيطة به.\n" +
                "\n" +
                "يصف الدرس التصميم والعزيمة الشخصية التي يظهرها أحمد في مواجهة الصعاب، حيث يعمل بجد ويتعلم عن البحارة والسفن. تتوالى الأحداث في القصة لتظهر كيف ينجح أحمد في تحقيق حلمه على الرغم من التحديات والظروف الصعبة التي يواجهها.\n" +
                "\n" +
                "تكمن الرسالة الأساسية للقصة في أهمية الأمل والإرادة القوية لتحقيق الأحلام والتغلب على الصعاب. يشجع الدرس الطلاب على أن يكونوا صامدين في وجه التحديات وأن يستمروا في السعي نحو تحقيق أحلامهم، رغم الظروف الصعبة التي قد تواجههم.\n" +
                "\n" +
                "تترك القصة أثرًا عميقًا في نفوس الطلاب حيث يتعاطفون مع أحمد ويتعلمون القيمة الحقيقية للصمود والتفاؤل في وجه الصعاب.", R.drawable.gaza);
        lessons[6] = new Lesson("الغراب والثعلب", "في الحصول على قطعة من الطعام.\n" +
                "\n" +
                "في بداية القصة، يعثر الغراب على قطعة من الجبن مرمية على الأرض. يحاول الغراب الاستمتاع بهذه الوجبة بمفرده، ولكن يلاحظ أن الثعلب يلاحقه ليسرق الجبن منه. يحاول الغراب الهروب والاحتفاظ بالجبن، لكن الثعلب يظهر أنه ذكي ويتلاعب بالغراب.\n" +
                "\n" +
                "يتظاهر الثعلب بأنه يعجب بصوت الغراب ويريد أن يسمعه يغني. يقع الغراب في فخ الثعلب ويفتح منقاره للغناء، في هذه اللحظة يسقط الجبن من منقاره. يلتقطه الثعلب ويهرب به.\n" +
                "\n" +
                "تنتهي القصة بتأكيد العبرة، حيث يدرك الغراب أنه كان طيشًا وسذاجة بالثقة في الثعلب. يعتبر الغراب أن الذكاء والحذر أمور حيوية في التعامل مع الآخرين، وعندما يكون للطرف الآخر نوايا سيئة قد يتلاعب به ويسرق ما لديه.\n" +
                "\n" +
                "تكمن الرسالة الأساسية للقصة في أن الدهاء والترقب قد يمنعانا من الوقوع في الفخ والاحتيال. يعتبر الاحتراس وفهم نوايا الآخرين جزءًا أساسيًا من الحياة، وعندما نكون مطلعين على الخدع والأفخاخ المحتملة، يمكننا تجنب الأخطاء وحماية مصالحنا.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n", R.drawable.gorab);
        lessons[7] = new Lesson("المبدهة الصغيرة", "طلبت من والده ان يلحقها بدوره المتقدمه في الحاسوب وافق الوالد لا يؤثر ذلك سلبا على دراستها وفي الدوره ابدى تعليم مهاره فائقه في برامج الانترنيت كثير مهمه. التعبير يضمن عبر الموقف الاتي باربع جمل مفيده عصام بحب الاكتشاف والاختراع يذهب الى السوق يشتري اجهزه قديمه بس ك ك. بيكشف.", R.drawable.almobde3a);
        lessons[8] = new Lesson("ذكاء القاضي اياس", "\"ذكاء القاضي إياس\" هي قصة مأخوذة من التراث العربي وتعرف بقصة الحكيم إياس. تحكي القصة عن قاضٍ مشهور بحكمته وذكائه العالي في حل المشكلات وفهم الحقائق.\n" +
                "\n" +
                "في القصة، يتقدم رجلان إلى القاضي إياس للحكم في نزاع بينهما. يزعم الرجل الأول أن الرجل الآخر سرق ثمرة من شجرته، بينما ينفي الرجل الثاني هذا الادعاء ويدافع عن نزاهته.\n" +
                "\n" +
                "بدلاً من إصدار حكم فوري، يبتكر القاضي إياس خطة لاختبار ذكاء الرجلين. يقترح أن يتم وضع الثمرة المتنازع عليها في سلة خشبية على ظهر النهر، ويطلب من كل رجل أن يمسك بحبل السلة ويحاول جذبها نحوه.\n" +
                "\n" +
                "في هذا الاختبار، يلاحظ القاضي إياس أن الرجل الأول يتراجع عن المحاولة بسرعة ويترك الحبل، بينما يبقى الرجل الثاني ثابتًا ويستمر في جذب السلة. يستنتج القاضي إياس من ذلك أن الرجل الثاني هو الشخص الذي يتقن الحقيقة ويقول الحقيقة، في حين أن الرجل الأول كان يكذب ويحاول تبرير سرقته.\n" +
                "\n" +
                "بهذا الاختبار الذكي، يكشف القاضي إياس عن الحقيقة ويحكم بأن الرجل الثاني بريء والرجل الأول هو الذي ارتكب السرقة.\n" +
                "\n" +
                "تكمن العبرة الأساسية من القصة في أن الحكمة والذكاء يمكن أن تساعد في كشف الحقيقة وتحقيق العدالة. كما تدعو القصة إلى أهمية الصدق والتزام الحقيقة في التصرف والإدلاء بالشهادة.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n", R.drawable.eeaass);
        lessons[9] = new Lesson("في حديقة الحيوان",
                "\"في حديقة الحيوان\" هو درس يستكشف حياة الحيوانات في الحدائق العامة ويوفر للأطفال فهمًا أفضل للحياة البرية والمسؤولية تجاه الحيوانات.\n" +
                "\n" +
                "يتناول الدرس الحديقة العامة كمكان يستضيف مجموعة متنوعة من الحيوانات، بما في ذلك الثدييات والطيور والزواحف والأسماك والحشرات. يوضح الدرس أهمية حماية ورعاية هذه الحيوانات والحفاظ على بيئاتها الطبيعية.\n" +
                "\n" +
                "يتعرف الأطفال على الحيوانات المختلفة وسماتها المميزة، ويتعلمون عن طرائق الغذاء والتكاثر والتواصل لكل نوع. يشجع الدرس على التعاطف والاحترام للحيوانات وضرورة الحفاظ على حيويتها وسلامتها.\n" +
                "\n" +
                "يتعلم الأطفال أيضًا حول الدور الذي تلعبه الحدائق العامة في توفير بيئة آمنة ومحمية للحيوانات، وكيفية تعلم المزيد عن الحيوانات من خلال الزيارات والمشاهدة والقراءة.\n" +
                "\n" +
                "تكمن الرسالة الأساسية للدرس في أهمية حماية الحياة البرية والتعايش مع الحيوانات بشكل مسؤول. يشجع الدرس الأطفال على أن يكونوا حاملين للوعي البيئي والحفاظ على التنوع البيولوجي ومحمية الحيوانات وبيئاتها، وذلك من خلال اتخاذ الإجراءات الملائمة لحمايتها والعمل بصورة مسؤولة تجاهها.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n", R.drawable.zoo);
        return lessons;
    }
}
